Repository: sakawsar/woocommerce_creditguard
Catalog: languages/talpress-woocommerce-creditguard-*.po
Languages: ar, he_il, ru_ru

source: Iframe Height
ar: ارتفاع Iframe
he_il: גובה iFrame
ru_ru: Высота Iframe

source: Iframe Width
ar: عرض Iframe
he_il: רוחב iFrame
ru_ru: Ширина Iframe

source: Accept CreditGuard payments on WooCommerce
ar: قبول مدفوعات CreditGuard على WooCommerce
he_il: אפשרו תשלום מאובטח בכרטיס אשראי באמצעות קרדיטגארד
ru_ru: Принимайте платежи CreditGuard на WooCommerce

source: Add more data to the URL
ar: إضافة المزيد من البيانات إلى عنوان URL
he_il: שלחו עוד נתונים בURL
ru_ru: Добавьте больше данных в URL

source: Allow payments using creditguard
ar: السماح بالدفع باستخدام creditguard
he_il: הפעלת תשלום באמצעות קרדיט גארד
ru_ru: Разрешить оплату с помощью кредитной карты

source: Allow returning customers to pay with a previously saved TOKEN
ar: السماح للعملاء الدائمين بالدفع باستخدام رمز تم حفظه مسبقاً
he_il: אפשרו ללקוחות חוזרים לשלם באמצעות TOKEN שנשמר מהזמנות קודמות
ru_ru: Позволить возвращающимся клиентам оплачивать покупки с помощью ранее сохраненного ТОКЕНА

source: Allow Saved Tokens
ar: السماح بالرموز المحفوظة
he_il: אפשר שמירת TOKEN
ru_ru: Разрешить сохраненные токены

source: Authorization
ar: التصريح
he_il: אימות
ru_ru: Авторизация

source: Auto
ar: تلقائي
he_il: אוטומטי
ru_ru: Авто

source: Cancel order &amp; restore cart
ar: إلغاء الطلب &amp; واستعادة السلة
he_il: ביטול הזמנה ושחזור סל קניות
ru_ru: Отменить заказ &amp; восстановить корзину

source: Capture
ar: التقاط
he_il: לכידה
ru_ru: Захват

source: CC Number
ar: رقم CC
he_il: מספר כרטיס אשראי
ru_ru: Номер CC

source: Checkout Description
ar: وصف عملية الدفع
he_il: תיאור בדף תשלום
ru_ru: Описание выписки

source: Checkout Title
ar: عنوان عملية الدفع
he_il: כותרת בדף תשלום
ru_ru: Название кассы

source: Clear log
ar: مسح السجل
he_il: ניקוי לוג
ru_ru: Очистить журнал

source: Click <a href="%s">here </a>to return to the checkout page.
ar: اضغط <a href="%s">هنا </a>للعودة إلى صفحة الدفع.
he_il: לחצו כאן בכדי לחזור לעמוד התשלום
ru_ru: Нажмите <a href="%s">здесь</a>, чтобы вернуться на страницу оформления заказа.

source: Credentials
ar: بيانات الاعتماد
he_il: פרטי גישה
ru_ru: Учетные данные

source: CreditGuard By TalPress
ar: creditguard عن طريق TalPress
he_il: קרדיט גארד מבית TalPress
ru_ru: CreditGuard от TalPress

source: Creditguard delayed payment completed
ar: لقد اكتملت عملية الدفع المتأخرة بواسطة Creditguard
he_il: תשלום בהשהייה הושלם
ru_ru: Отсроченный платеж Creditguard завершен

source: Creditguard delayed payment failed:
ar: لقد فشلت عملية الدفع المتأخرة بواسطة Creditguard
he_il: תשלום בהשהייה נכשל:
ru_ru: Creditguard отсрочил платеж:

source: CreditGuard for WooCommerce by TalPress
ar: creditguard من أجل WooCommerce عن طريق TalPress
he_il: קרדיט גארד לווקומרס מבית TalPress
ru_ru: CreditGuard для WooCommerce от TalPress

source: Creditguard gateway URL
ar: عنوان URL لبوابة Creditguard
he_il: כתובת שער Gateway
ru_ru: URL-адрес шлюза Creditguard

source: Creditguard Merchand ID
ar: معرف تاجر Creditguard
he_il: מזהה סוחר

source: Creditguard payment completed
ar: لقد اكتملت عملية دفع Creditguard
he_il: תשלום בקרדיט גארד הושלם
ru_ru: Оплата услуг кредитной организации завершена

source: Creditguard payment failed
ar: لقد فشلت عملية دفع Creditguard
he_il: תשלום בקרדיט גארד נכשל
ru_ru: Платеж Creditguard не прошел

source: Creditguard payment failure
ar: فشل عملية دفع Creditguard
he_il: כשלון בתשלום בקרדיט גארד
ru_ru: Ошибка платежа Creditguard

source: Creditguard Payment information for delayed payment
ar: معلومات دفع Creditguard للدفعة المتأخرة
ru_ru: Платежная информация Creditguard для отложенного платежа

source: Creditguard payment verified
ar: تم تأكيد دفعة Creditguard
he_il: תשלום בקרדיט גארד אומת
ru_ru: Платеж Creditguard проверен

source: Creditguard payment via saved cc completed
ar: لقد تمت دفعة Creditguard عن طريق البطاقة الائتمانية المحفوظة
he_il: תשלום באמצעות כרטיס אשראי שמור הושלם
ru_ru: Оплата через сохраненный сс Creditguard завершена

source: Creditguard payment via saved cc verified
ar: تم تأكيد دفعة Creditguard عن طريق البطاقة الائتمانية المحفوظة
he_il: תשלום באמצעות כרטיס אשראי שמור אומת
ru_ru: Creditguard оплата через сохраненный cc проверена

source: Creditguard profile information
ar: معلومات ملف Creditguard
he_il: מידע על לקוח מקרדיט גארד
ru_ru: Информация о профиле Creditguard

source: Creditguard refund transaction-id:
ar: معرف معاملة إعادة الأموال عبر Creditguard:
he_il: מזהה החזר כספי בקרדיט גארד:
ru_ru: Номер транзакции возврата Creditguard:

source: Creditguard terminal number
ar: رقم محطة Creditguard
he_il: מספר מסוף
ru_ru: Номер терминала Creditguard

source: Creditguard terminal password
ar: كلمة مرور محطة Creditguard
he_il: סיסמת מסוף
ru_ru: Пароль терминала Creditguard

source: Creditguard terminal username
ar: اسم مستخدم محطة Creditguard
he_il: שם משתמש
ru_ru: Имя пользователя терминала Creditguard

source: Creditguard Token for future payments
ar: رمز Creditguard للمدفوعات المستقبلية
he_il: טוקן לתשלומים עתידיים
ru_ru: Токен Creditguard для будущих платежей

source: Currency
ar: العملة
he_il: מטבע
ru_ru: Валюта

source: Debug
ar: تصحيح الخطأ
he_il: ניפוי שגיאות
ru_ru: Отладка

source: Debugging
ar: تصحيح الأخطاء
he_il: ניפוי שגיאות
ru_ru: Отладка

source: Debugging Mode
ar: وضع تصحيح الأخطاء
he_il: מצב ניפוי שגיאות
ru_ru: Режим отладки

source: Description on checkout page.
ar: الوصف على صفحة الدفع.
he_il: תיאור בדף התשלום.
ru_ru: Описание на странице оформления заказа.

source: Disable this option if you are using WPML with language parameter.
ar: قم بتعطيل هذا الخيار إذا كنت تستخدم WPML مع معلم اللغة.
he_il: בטל אפשרות זו אם הינך משתמש ב WPML עם פרמטר שפה.
ru_ru: Отключите эту опцию, если вы используете WPML с параметром языка.

source: Discount
ar: تخفيض
he_il: הנחה
ru_ru: Скидка

source: Donation
ar: تبرع
he_il: תרומה
ru_ru: Пожертвование

source: Enable payment with CreditGuard
ar: تفعيل الدفع عن طريق Creditguard
he_il: הפעלת תשלום באמצעות קרדיט גארד
ru_ru: Включите оплату с помощью CreditGuard

source: Enable/Disable
ar: تفعيل/تعطيل
he_il: הפעלה וכיבוי
ru_ru: Включить/выключить

source: Encoding
ar: التشفير
he_il: קידוד
ru_ru: Кодирование

source: English
ar: اللغة الانجليزية
he_il: אנגלית
ru_ru: Английский язык

source: Error code :
ar: كود الخطأ:
he_il: קוד שגיאה:
ru_ru: Код ошибки :

source: Error text :
ar: نص الخطأ:
he_il: טקסט שגיאה:
ru_ru: Текст ошибки :

source: European currency unit
ar: وحدة العملة الأوروبية
he_il: מטבע אירופאי
ru_ru: Европейская валютная единица

source: Expiration
ar: انتهاء الصلاحية
he_il: תוקף
ru_ru: Срок действия

source: Expiration Date
ar: تاريخ انتهاء الصلاحية
he_il: תוקף
ru_ru: Дата истечения срока действия

source: First payment
ar: الدفعة الأولى
he_il: תשלום ראשון
ru_ru: Первый платеж

source: Force SSL
ar: فرض SSL
he_il: הכרח שימוש בSSL
ru_ru: Принудительное SSL

source: Gateway URL
ar: عنوان URL للبوابة
he_il: כתובת שער Gateway
ru_ru: URL шлюза

source: Generate CreditGuard invoices
ar: إنشاء فواتير CreditGuard
he_il: הפקת חשבוניות מקרדיט גארד
ru_ru: Создание счетов-фактур CreditGuard

source: Great Britain Pound
ar: جنيه بريطاني
he_il: פאונד בריטי
ru_ru: Британский фунт

source: Hebrew
ar: اللغة العبرية
he_il: עברית
ru_ru: Иврит

source: Hong Kong Dollar
ar: دولار هونغ كونغي
he_il: דולר הונג קונג
ru_ru: Гонконгский доллар

source: Include VAT
ar: شامل ضريبة القيمة المضافة
he_il: לכלול מע"מ
ru_ru: Включая НДС

source: Invoice number
ar: رقم الفاتورة
he_il: מספר חשבונית
ru_ru: Номер счета-фактуры

source: Invoice response code
ar: رمز استجابة الفاتورة
he_il: קוד תשובה לחשבונית
ru_ru: Код ответа на счет-фактуру

source: Invoice response name
ar: اسم استجابة الفاتورة
he_il: שם תשובה לחשבונית
ru_ru: Имя ответа на счет-фактуру

source: Invoice url
ar: عنوان URL للفاتورة
he_il: כתובת חשבונית
ru_ru: Адрес счета-фактуры

source: Invoices
ar: الفواتير
he_il: חשבוניות
ru_ru: Счета-фактуры

source: Japanese Yen
ar: ين ياباني
he_il: יין יפני
ru_ru: Японская иена

source: Language
ar: اللغة
he_il: שפה
ru_ru: Язык

source: Load the secured Creditguard page in an iframe
ar: تحميل صفحة Creditguard المؤمّنة في iframe
he_il: הצג את עמוד התשלום ב iFrame
ru_ru: Загрузите защищенную страницу Creditguard в iframe

source: Mailed to
ar: تم الإرسال إلى
he_il: נשלח אל
ru_ru: По почте

source: Main
ar: الرئيسي
he_il: ראשי
ru_ru: Главная

source: Max Payments
ar: الحد الأقصى للمدفوعات
he_il: מקסימום תשלומים
ru_ru: Максимальные платежи

source: Merchant id
ar: معرف التاجر
he_il: מזהה סוחר
ru_ru: Идентификатор продавца

source: More Options
ar: المزيد من الخيارات
he_il: עוד אפשרויות
ru_ru: Дополнительные опции

source: New credit card
ar: بطاقة ائتمان جديدة
he_il: כרטיס אשראי חדש
ru_ru: Новая кредитная карта

source: New Israeli Shekel
ar: شيكل إسرائيلي جديد
he_il: שקל ישראלי
ru_ru: Новый израильский шекель

source: Pay via Creditguard
ar: الدفع عن طريق Creditguard
he_il: תשלום מאובטח באמצעות קרדיט גארד
ru_ru: Оплата через Creditguard

source: Payment failure, please try again or contact the store administrator
ar: فشل الدفع، من فضلك حاول مرة أخرى أو تواصل مع مدير المتجر
he_il: התשלום נכשל, אנא נסו שנית או צרו קשר עם מערכת האתר.
ru_ru: Сбой платежа, пожалуйста, попробуйте еще раз или свяжитесь с администратором магазина

source: Payment Type
ar: نوع الدفع
he_il: סוג התשלום
ru_ru: Тип оплаты

source: Payments
ar: المدفوعات
he_il: תשלומים
ru_ru: Платежи

source: Payments :
ar: المدفوعات:
he_il: תשלומים:
ru_ru: Платежи :

source: Periodical payment
ar: الدفع الدوري
ru_ru: Периодическая оплата

source: please select the number of payments
ar: من فضلك حدد عدد الدفعات
he_il: בחרו את מספר התשלומים
ru_ru: пожалуйста, выберите количество платежей

source: Process
ar: معالجة
ru_ru: Процесс

source: Receipt
ar: إيصال
he_il: קבלה
ru_ru: Квитанция

source: renewal failed
ar: فشل التجديد
he_il: החידוש נכשל
ru_ru: обновление не состоялось

source: Saved credit card that ends with :
ar: بطاقة الائتمان المحفوظة التي تنتهي بـ:
he_il: כרטיס אשראי שמור המסתיים בספרות:
ru_ru: Сохраненная кредитная карта, которая заканчивается на :

source: Secure payment with CreditGuard
ar: الدفع الآمن مع CreditGuard
he_il: תשלום מאובטח בכרטיס אשראי באמצעות קרדיט גארד
ru_ru: Безопасная оплата с помощью CreditGuard

source: Send additional data
ar: إرسال بيانات إضافية
he_il: שליחת מידע נוסף
ru_ru: Отправить дополнительные данные

source: Send the product descriptions instead of the order number
ar: إرسال أوصاف المنتج بدلاً من رقم الطلب
he_il: שליחת תיאורי מוצר במקום מספר ההזמנה
ru_ru: Отправляйте описания товаров вместо номера заказа

source: Set the Iframe height in PX
ar: حدد ارتفاع Iframe بالنقاط PX
he_il: בחרו את גובה ה iFrame בפיקסלים
ru_ru: Установите высоту Iframe в PX

source: Set the Iframe width in PX , leave blank for 100%
ar: حدد عرض Iframe بالنقاط PX، واتركه فارغاً إذا كانت النسبة 100%
he_il: בחרו את רוחב ה iFrame בפיקסלים
ru_ru: Установите ширину Iframe в PX, оставьте пустым для 100%.

source: Set the maximum allowed payments.
ar: حدد الحد الأقصى للمدفوعات المسموح بها.
he_il: בחרו את מספר התשלומים המקסימלי.
ru_ru: Установите максимально допустимый размер платежей.

source: Set the title for Checkout page.
ar: حدد عنوان صفحة الدفع.
he_il: הגדרת הכותרת בדף התשלום.
ru_ru: Установите заголовок для страницы оплаты.

source: Settings
ar: الإعدادات
he_il: הגדרות
ru_ru: Настройки

source: Tax Invoice
ar: الفاتورة الضريبية
he_il: חשבונית מס
ru_ru: Налоговая накладная

source: Terminal number
ar: رقم المحطة
he_il: מספר המסוף
ru_ru: Номер терминала

source: Terminal password
ar: كلمة مرور المحطة
he_il: סיסמת המסוף
ru_ru: Пароль терминала

source: Terminal username
ar: اسم مستخدم المحطة
he_il: שם משתמש
ru_ru: Имя пользователя терминала

source: This is a verification order just to replace your billing information
ar: هذا طلب تحقق فقط لاستبدال معلومات فواتيرك
ru_ru: Это проверочный заказ для замены вашей платежной информации

source: This Overrides the Max Payments setting !!! to use conditional payment simply enter a comma separated amounts e.g 200,400,600 -> this will set the payments to be 1 for lower than 200 , 2 for lower than 400 etc ...
ar: هذا يتجاوز إعدادات الحد الأقصى للمدفوعات!!! ولاستخدام الدفع المشروط ببساطة أدخل المبالغ وبينها فواصل كما في المثال التالي 200,400,600 -> وهذا سوف يضبط المدفوعات على أن تكون 1 للأقل من 200، و2 للأقل من 400، إلخ.
ru_ru: Это отменяет настройку Max Payments !!! для использования условных платежей просто введите суммы через запятую, например 200,400,600 -> это установит платежи 1 для сумм меньше 200, 2 для сумм меньше 400 и т.д. ...

source: Tiered Payments
ar: المدفوعات المتدرجة
ru_ru: Многоуровневые платежи

source: Token
ar: الرمز
he_il: טוקן
ru_ru: Токен

source: Type
ar: النوع
he_il: סוג
ru_ru: Тип

source: United States Dollar
ar: دولار أمريكي
he_il: דולר אמריקאי
ru_ru: Доллар США

source: Use Iframe
ar: استخدام iFrame
he_il: השתמש ב iFrame
ru_ru: Используйте Iframe

source: Use product descriptions
ar: استخدم أوصاف المنتجات
he_il: השתמש בתיאור המוצר
ru_ru: Используйте описания товаров

source: Use when site is using SSL
ar: استخدمه عندما يكون الموقع يستخدم SSL
he_il: סמן אם האתר שלך משתמש בSSL
ru_ru: Используется, когда сайт использует SSL

source: VAT
ar: ضريبة القيمة المضافة
he_il: מע"מ
ru_ru: НДС

source: View log
ar: عرض السجل
he_il: הצגת לוג
ru_ru: Просмотр журнала

source: creditguard
he_il: קרדיט גארד
